# -*- coding: utf-8 -*-
import os
import pymysql

# 打开数据库连接
from utils.MysqlProxy import MysqlProxy

db = pymysql.connect(host='192.168.1.151', port=3306, user='root', passwd='123456', db='jm_statement', charset='utf8')
cursor = db.cursor()  # 使用cursor()方法获取操作游标

# dict={'静久康铭（上海）投资管理有限公司－静康创新稳健1号私募证券投资基金-客户对账单-2100818998_20211124.xlsx':'80'}


# 数据字典，需要时更新
dict = {'0011000048久铭专享6号-20220303.txt': 395, '0040173340.txt': 201, '0040176871.txt': 35, '0040177051.txt': 95,
        '01125828久铭稳健1号-20220303.txt': 265, '01125880久铭稳健23号-20220303.txt': 342, '01127500久铭专享6号-20220303.txt': 277,
        '0537536302对账单20211124.xlsx': 343, '0537556778对账单20211124.xlsx': 279, '06005-期权客户对账单0537536302': 343,
        '06005-期权客户对账单0537556778': 279, '11650079.txt': 427, '1780008557.txt': 122, '1780010375.txt': 132,
        '1780013239.txt': 142, '1788400145.txt': 143, '1788400157.txt': 133,
        '18083918-久铭稳健18号-18083918-账户对账单-20220303.txt': 249, '1880000381.txt': 101,
        '200510027999上海久铭投资管理有限公司－久铭5对账单20220303.xlsx': 85, '200510027999上海久铭投资管理有限公司－久铭5港股通对账单20220303.xlsx': 428,
        '201000039993上海久铭投资管理有限公司－久铭专对账单20220303.xlsx': 428, '201000040090静康稳健3号对账单20220303.xlsx': 13,
        '201000040091静久康铭稳健5号对账单20220303.xlsx': 1, '201000040800上海久铭投资管理对账单20220303.xlsx': 268,
        '20220303_120302695_交易结算单.txt': 353, '20220303_800600388_交易结算单.txt': 422, '20220303_85011002_交易结算单.TXT': 91,
        '207180166账单(盯市).txt': 166, '207180320账单(盯市).txt': 5, '207180321账单(盯市).txt': 166, '207180323账单(盯市).txt': 287,
        '217739久铭价值1号私募证券投资基金20220303.xlsx': 165, '22004948久铭稳健23号20220303.txt': 429, '23003943-1123.pdf': 191,
        '257188925账单(盯市).txt': 194, '257188926账单(盯市).txt': 196, '257188928账单(盯市).txt': 100,
        '29202731久铭10号私募证券投资基金20220303.txt': 17, '30000072.txt': 24, '31681742_20220303_两融对账单.xlsx': 376,
        '31681742_20220303_交割单.txt': 377, '31681742_20220303_基金对账单.txt': 377, '31681742_20220303_普通对账单.txt': 377,
        '31681742_20220303_普通对账单.xlsx': 377, '31681745_20220303_两融对账单.xlsx': 383, '31681745_20220303_交割单.txt': 384,
        '31681745_20220303_基金对账单.txt': 384, '31681745_20220303_普通对账单.txt': 384, '31681745_20220303_普通对账单.xlsx': 384,
        '31681747_20220303_交割单.txt': 378, '31681747_20220303_基金对账单.txt': 378, '31681747_20220303_普通对账单.txt': 378,
        '31681747_20220303_普通对账单.xlsx': 378, '31681750_20220303_交割单.txt': 385, '31681750_20220303_基金对账单.txt': 385,
        '31681750_20220303_普通对账单.txt': 385, '31681750_20220303_普通对账单.xlsx': 385, '31681752_20220303_交割单.txt': 363,
        '31681752_20220303_基金对账单.txt': 363, '31681752_20220303_普通对账单.txt': 363, '31681752_20220303_普通对账单.xlsx': 363,
        '31681753_20220303_交割单.txt': 386, '31681753_20220303_基金对账单.txt': 386, '31681753_20220303_普通对账单.txt': 386,
        '31681753_20220303_普通对账单.xlsx': 386, '31681756_20220303_两融对账单.xlsx': 431, '31681756_20220303_交割单.txt': 33,
        '31681756_20220303_基金对账单.txt': 33, '31681756_20220303_普通对账单.txt': 33, '31681756_20220303_普通对账单.xlsx': 33,
        '31681758_20220303_交割单.txt': 412, '31681758_20220303_基金对账单.txt': 412, '31681758_20220303_普通对账单.txt': 412,
        '31681758_20220303_普通对账单.xlsx': 412, '380064097久铭稳健7号20220303对帐单.txt': 330, '50061487久铭专享1号20220303.xls': 119,
        '50062949久铭7号对账单20220303.xls': 409, '50063746久铭专享11号20220303.xls': 364, '50074228久铭8号20220303.xls': 425,
        '550825.txt': 58, '550826.txt': 69, '55152073久铭稳健23号20220303.txt': 286, '55816988-1123.TXT': 192,
        '56569303_久铭创新稳健1号_20220303.txt': 120, '56611841_久铭创新稳健2号_20220303.txt': 131, '699020-盯市.TXT': 129,
        '699021-盯市.TXT': 139, '8001001277帐单(盯市)20220303.TXT': 74, '8001002035帐单(盯市)20220303.TXT': 181,
        '8001002072帐单(盯市)20220303.TXT': 9, '80121599久铭专享25号私募20220303.TXT': 388, '8034543.pdf': 262, '8034622.pdf': 226,
        '8034623.pdf': 237, '8034624.pdf': 296, '8034629.pdf': 209, '8034630.pdf': 65, '8034632.pdf': 232,
        '8034648.pdf': 340, '8034649.pdf': 314, '8034651.pdf': 214, '8034652.pdf': 220, '8034666.pdf': 347,
        '8034670.pdf': 308, '8034672.pdf': 326, '8034701.pdf': 257, '8035770.pdf': 272,
        '829202731久铭10号私募证券投资基金20220303.xls': 20, '929202731久铭10号私募证券投资基金20220303.xls': 19, '99148740-1123.TXT': 193,
        'dzd_666810006045_久铭全球丰收1号_20220303.xlsx': 185, 'HTSC_20006_D1S_20220303_久铭稳健22号南向互换.xlsx': 282,
        'HTSC_20111_D1S_20220303_久铭1号南向互换.xlsx': 43, 'HTSC_20113_D1S_20220303_久铭全球1号南向互换.xlsx': 175,
        'HTSC_20115_D1S_20220303_久铭稳健23号南向互换.xlsx': 295, 'HTSC_20300_D1S_20220303_久铭专享8号南向互换.xlsx': 426,
        'HTSC_20304_D1S_20220303_久铭稳健1号南向互换.xlsx': 271, 'rzrqdzd_960000046721_久铭全球丰收1号_20220303.xlsx': 186,
        'Statement_103089--HKD--EQ_20220303.xlsx': 42, 'Statement_103089--USD--EQ_20220303.xlsx': 42,
        'Statement_103192--HKD--EQ_20220303.xlsx': 55, 'Statement_103192--USD--EQ_20220303.xlsx': 55,
        'Statement_103423--HKD--EQ_20220303.xlsx': 325, 'Statement_103423--USD--EQ_20220303.xlsx': 325,
        'Statement_106560--HKD--EQ_20220303.xlsx': 357, 'Statement_106560--USD--EQ_20220303.xlsx': 357,
        'Statement_106672--HKD--EQ_20220303.xlsx': 415, 'Statement_106672--USD--EQ_20220303.xlsx': 415,
        '上海久铭投资管理有限公司－久铭1号私募证券投资基金-合并交割单-9912900230_20220303.xlsx': 26,
        '上海久铭投资管理有限公司－久铭1号私募证券投资基金-客户对账单-9912900230_20220303.xlsx': 26,
        '上海久铭投资管理有限公司－久铭1号私募证券投资基金_102600004011_普通账户对账单(人民币)_20220303.xls': 28,
        '上海久铭投资管理有限公司－久铭1号私募证券投资基金_661026000005_股票期权对账单(人民币)_20220303.xls': 29,
        '上海久铭投资管理有限公司－久铭6号私募证券投资基金-个股期权对账单-9008016899_20220303.xlsx': 94,
        '上海久铭投资管理有限公司－久铭6号私募证券投资基金-客户对账单-2100818901_20220303.xlsx': 93,
        '上海久铭投资管理有限公司－久铭6号私募证券投资基金-融资融券账户对账单（含约定融资＆约定融券）-8009210078_20220303.xlsx': 92,
        '上海久铭投资管理有限公司－久铭9号私募证券投资基金-合并交割单-20300226096_20220303.xlsx': 110,
        '上海久铭投资管理有限公司－久铭9号私募证券投资基金-客户对账单-20300226096_20220303.xlsx': 110,
        '上海久铭投资管理有限公司－久铭9号私募证券投资基金-客户对账单-2100818939_20220303.xlsx': 112,
        '上海久铭投资管理有限公司－久铭9号私募证券投资基金-融资融券账户对账单-8009216631_20220303.xlsx': 111,
        '上海久铭投资管理有限公司－久铭专享15号私募证券投资基金-客户对账单-2100818948_20220303.xlsx': 366,
        '上海久铭投资管理有限公司－久铭专享15号私募证券投资基金-融资融券账户对账单-8009219195_20220303.xlsx': 367,
        '上海久铭投资管理有限公司－久铭专享16号私募证券投资基金-客户对账单-32800000273_20220303.xlsx': 369,
        '上海久铭投资管理有限公司－久铭专享16号私募证券投资基金-融资融券账户对账单-8009243503_20220303.xlsx': 370,
        '上海久铭投资管理有限公司－久铭专享17号私募证券投资基金-客户对账单-2100818983_20220303.xlsx': 372,
        '上海久铭投资管理有限公司－久铭专享17号私募证券投资基金-融资融券账户对账单（含约定融资＆约定融券）-8009225896_20220303.xlsx': 373,
        '上海久铭投资管理有限公司－久铭专享2号私募证券投资基金-客户对账单-2100819008_20220303.xlsx': 389,
        '上海久铭投资管理有限公司－久铭专享2号私募证券投资基金-融资融券账户对账单-8009229246_20220303.xlsx': 390,
        '上海久铭投资管理有限公司－久铭专享6号私募证券投资基金-个股期权对账单-9008017183_20220303.xlsx': 400,
        '上海久铭投资管理有限公司－久铭专享6号私募证券投资基金-客户对账单-2100818916_20220303.xlsx': 397,
        '上海久铭投资管理有限公司－久铭专享7号私募证券投资基金-个股期权对账单-9008016945_20220303.xlsx': 407,
        '上海久铭投资管理有限公司－久铭专享7号私募证券投资基金-客户对账单-30900001680_20220303.xlsx': 408,
        '上海久铭投资管理有限公司－久铭专享7号私募证券投资基金-融资融券账户对账单-8009210312_20220303.xlsx': 406,
        '上海久铭投资管理有限公司－久铭专享8号私募证券投资基金-个股期权对账单-9008017036_20220303.xlsx': 418,
        '上海久铭投资管理有限公司－久铭专享8号私募证券投资基金-合并交割单-9912900247_20220303.xlsx': 419,
        '上海久铭投资管理有限公司－久铭专享8号私募证券投资基金-客户对账单-32800000270_20220303.xlsx': 421,
        '上海久铭投资管理有限公司－久铭专享8号私募证券投资基金-客户对账单-9912900247_20220303.xlsx': 419,
        '上海久铭投资管理有限公司－久铭专享8号私募证券投资基金-融资融券账户对账单-8009210785_20220303.xlsx': 417,
        '上海久铭投资管理有限公司－久铭信利私募证券投资基金-个股期权对账单-9008017753_20220303.xlsx': 354,
        '上海久铭投资管理有限公司－久铭信利私募证券投资基金-客户对账单-600565626_20220303.xlsx': 355,
        '上海久铭投资管理有限公司－久铭信利私募证券投资基金-融资融券账户对账单-8009204822_20220303.xlsx': 356,
        '上海久铭投资管理有限公司－久铭全球丰收1号私募证券投资基金-客户对账单-21800008530_20220303.xlsx': 179,
        '上海久铭投资管理有限公司－久铭创新稳禄12号私募证券投资基金-客户对账单-710002475_20220303.xlsx': 153,
        '上海久铭投资管理有限公司－久铭创新稳禄12号私募证券投资基金-融资融券账户对账单（含约定融资＆约定融券）-8009232222_20220303.xlsx': 154,
        '上海久铭投资管理有限公司－久铭创新稳禄14号私募证券投资基金-客户对账单-1018001143_20220303.xlsx': 155,
        '上海久铭投资管理有限公司－久铭创新稳禄14号私募证券投资基金-融资融券账户对账单（含约定融资＆约定融券）-8009237093_20220303.xlsx': 156,
        '上海久铭投资管理有限公司－久铭创新稳禄2号私募证券投资基金-客户对账单-710002463_20220303.xlsx': 158,
        '上海久铭投资管理有限公司－久铭创新稳禄2号私募证券投资基金-融资融券账户对账单（含约定融资＆约定融券）-8009229903_20220303.xlsx': 159,
        '上海久铭投资管理有限公司－久铭创新稳禄3号私募证券投资基金-客户对账单-710002461_20220303.xlsx': 160,
        '上海久铭投资管理有限公司－久铭创新稳禄3号私募证券投资基金-融资融券账户对账单（含约定融资＆约定融券）-8009229925_20220303.xlsx': 161,
        '上海久铭投资管理有限公司－久铭收益2号私募证券投资基金-客户对账单-31200000281_20220303.xlsx': 199,
        '上海久铭投资管理有限公司－久铭收益2号私募证券投资基金-客户对账单-8009222267_20220303.xlsx': 200,
        '上海久铭投资管理有限公司－久铭稳健1号证券投资基金-客户对账单-9909177826_20220303.xlsx': 266,
        '上海久铭投资管理有限公司－久铭稳健23号私募证券投资基金-个股期权对账单-9008017013_20220303.xlsx': 290,
        '上海久铭投资管理有限公司－久铭稳健23号私募证券投资基金-融资融券账户对账单-8009115272_20220303.xlsx': 289,
        '久铭1号私募证券投资基金(210000511)_HS汇总对账单_20220303.xlsx': 31, '久铭1号融资融券对账单20220303.xls': 121,
        '久铭2号基金-两融对账单-8009185778_两融对账单_20220303.xlsx': 48, '久铭2号基金-客户对账单-600565370_普通对账单_20220303.xlsx': 46,
        '久铭300指数私募基金20220303-股票期权客户对账单.xls': 61, '久铭300指数私募基金20220303-融资融券对账单.xls': 60, '久铭300指数私募基金20220303.txt': 59,
        '久铭3号1128206.xlsx': 68, '久铭3号基金-客户对账单-600565371_普通对账单_20220303.xlsx': 63, '久铭500指数20220303-股票期权客户对账单.xls': 72,
        '久铭500指数20220303-融资融券对账单.xls': 71, '久铭500指数20220303.txt': 70,
        '久铭50指数私募基金_102600004303_普通账户对账单(人民币)_20220303.xls': 75,
        '久铭50指数私募基金_661026000006_股票期权对账单(人民币)_20220303.xls': 76,
        '久铭50指数私募基金_888836600062_信用账户对账单(人民币)_20220303.xls': 77, '久铭5号基金-个股期权对账单-9008006436_个股期权对账单_20220303.xlsx': 84,
        '久铭5号基金-客户对账单-600565209_普通对账单_20220303.xlsx': 80, '久铭5号私募证券投资基金(210000536)_HS汇总对账单_20220303.xlsx': 79,
        '久铭6号期权.txt': 97, '久铭9号1158272.xlsx': 116, '久铭专享10号私募证券投资基金(218001277)_HS汇总对账单_20220303.xlsx': 362,
        '久铭专享11号融资融券对账单20220303.xls': 365, '久铭专享6号私募证券投资基金_896900001898_普通账户对账单(人民币)_20220303.xls': 401,
        '久铭久盈2号(210000420)_HS汇总对账单_20220303.xlsx': 167, '久铭全球1号-客户对账单-83000001527_普通对账单20220303.xlsx': 173,
        '久铭创新稳健5号20220303-股票期权客户对账单.xls': 141, '久铭创新稳健5号20220303.txt': 140,
        '久铭创新稳健6号私募证券投资基金(210090115)_HS信用对账单_20220303.xlsx': 147,
        '久铭创新稳健6号私募证券投资基金(218001073)_HS汇总对账单_20220303.xlsx': 149,
        '久铭创新稳禄1号私募证券投资基金_880100001219_普通账户对账单（人民币）_20220303.xls': 157, '久铭投资-稳健22号20220303.xls': 275,
        '久铭收益2号-客户对账单-30200142027_20220303.xlsx': 197, '久铭收益2号-资金合并对账单-30200142027_20220303.xlsx': 197,
        '久铭稳健22号私募证券投资基金.xlsx': 284, '久铭稳健23号-客户对账单-600565339_普通对账单_20220303.xlsx': 288,
        '久铭稳健23号私募证券投资基金_880100001362_普通账户对账单(人民币)_20220303.xls': 292, '久铭稳健32号20220303.txt': 304,
        '久铭稳健6号-两融对账单-8009171719_两融对账单20220303.xlsx': 321, '久铭稳健6号-客户对账单-600565295_普通对账单20220303.xlsx': 320,
        '久铭稳健7号20220303-融资融券对账单.xls': 328, '久铭稳健7号20220303.txt': 327, '信用对账9970533057': 341, '信用对账9970533302': 276,
        '双盈1号1128205.xlsx': 213, '收益2号1158262.xlsx': 206, '普通柜台对账单_20220303-久铭全球丰收1号(12928637).xlsx': 177,
        '申万宏源-上海陆家嘴环路-久铭10号20220303.xlsx': 218, '申万宏源-上海陆家嘴环路-久铭2号20220303.xlsx': 47,
        '申万宏源-上海陆家嘴环路-久铭5号20220303.xlsx': 89, '申万宏源-上海陆家嘴环路-久铭5号双融20220303.xlsx': 83,
        '申万宏源-上海陆家嘴环路-久铭5号（期权）20220303.xlsx': 82, '申万宏源-上海陆家嘴环路-久铭稳健20220303.xlsx': 299, '稳健10号1128232.xlsx': 219,
        '稳健11号1128233.xlsx': 225, '稳健12号1128195.xlsx': 231, '稳健15号1128208.xlsx': 236, '稳健16号1128196.xlsx': 242,
        '稳健19号1128289.xlsx': 261, '稳健1号1128103.xlsx': 270, '稳健1号信用1128322.XLS': 263, '稳健21号1129598.xlsx': 274,
        '稳健2号1128197.xlsx': 300, '稳健3号1128252.xlsx': 313, '稳健5号1128230.xlsx': 318, '稳健7号1128255.xlsx': 333,
        '稳健9号1128229.xlsx': 345, '稳利2号1128258.xlsx': 352,
        '静久康铭（上海）投资管理有限公司－静康1号私募证券投资基金_102600004309_普通账户对账单(人民币)_20220303.xls': 3,
        '静久康铭（上海）投资管理有限公司－静康1号私募证券投资基金_661026000008_股票期权对账单(人民币)_20220303.xls': 8,
        '静久康铭（上海）投资管理有限公司－静康创新稳健1号私募证券投资基金-客户对账单-2100818998_20220303.xlsx': 10, '静康全球1号1158700.xlsx': 11,
        '静康稳健1号1158702.xlsx': 12
        }

# file_name = '静久康铭（上海）投资管理有限公司－静康创新稳健1号私募证券投资基金-客户对账单-2100818998_20211123.xlsx'

# 数据日期
date = 20220303

for files in os.walk(r'D:\Users\Temp'):
    print(files[-1])  # 当前路径下所有非目录子文件
    for filename in files[-1]:
        try:
            id = dict[filename]
        except:
            continue
        mp = MysqlProxy()
        sql = "INSERT INTO `statement_arrive` (`id`, `start_date`, `end_date`, `file_name`, `status`) VALUES (%s, %s, %s, %s,%s)"
        mp.create(sql, [id, date, date, filename,1])
        mp.close()

